icofoam-cases/buoyant-cavity-2D-dT=15/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //  
//          3 ___________ 2
//          |\            | \ 
//          | \           |  \
//          |   7_________|__ 6
//          |   |         |   |
//          0 __|_________ 1  |
//           \  |          \  |
//            \ |           \ |
//              4 ___________ 5
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

L        1.0;
H        1.0;
W        0.01;

nx       100;
ny       100;
nz       1;

xr       0.5;
ixr      #calc "1.0/$xr"; 
yr       0.5;
iyr      #calc "1.0/$yr";

vertices
(
    ( 0.0  0.0   0.0 )
    ( $L   0.0   0.0 )
    ( $L   $H    0.0 )
    ( 0.0  $H    0.0 )

    ( 0.0  0.0   $W )
    ( $L   0.0   $W )
    ( $L   $H    $W )
    ( 0.0  $H    $W )
);

blocks
(
   hex ( 0 1 2 3 4 5 6 7 ) ( $nx $ny $nz ) simpleGrading 
   (
      ( (0.5 1 $ixr) (0.5 1 $xr) )
      ( (0.5 1 $iyr) (0.5 1 $yr) ) 
      1 
   )
);

edges
(
);

boundary
(
    coldWall
    {
        type wall;
        faces
        (
            (0 4 7 3)     // Left Side
        );
    }

    hotWall
    {
        type wall;
        faces
        (
            (1 2 6 5)     // Right Side
        );
    }

    insulatedWalls
    {
        type wall;
        faces
        (            
            (5 4 0 1)     // Bottom Side
            (7 6 2 3)     // Top Side
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)     // Front Side
            (0 3 2 1)     // Back Side
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
